*** DATA DIVISION MAP ***

05 EMP-ID        PIC X(10).        OFFSET 0000 LENGTH 10
05 EMP-NAME      PIC X(30).        OFFSET 0010 LENGTH 30
05 AGE           PIC 9(3).         OFFSET 0040 LENGTH 3
05 SALARY        PIC S9(7)V99 COMP-3 OFFSET 0043 LENGTH 5
05 BONUS         PIC S9(5) COMP    OFFSET 0048 LENGTH 3
